<!-- dflook/terraform-github-actions {"workspace":"fallback-to-terraform-2","backend_type":"remote","backend":"b9463bbe3a91acd00ccee46a748fe4cb6dab4e616772bf4cde1726deb3649103","plan_job_ref":"Job Test Terraform cloud #186 at https://github.com/dflook/terraform-github-actions/actions/runs/6683921724","plan_hash":"4e263478956cfa46f2b7d1ae189e7367d31eabf14721c546e5b590d8de86f33a","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __fallback-to-terraform-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #186](https://github.com/dflook/terraform-github-actions/actions/runs/6683921724)